/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert('Watches', [{
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },
    {
      name: 'Rolex',
      price: '9650$',
      model: 'Submariner',
      type: 'Наручные часы [Aurum] - это воплощение мастерства и элегантности. Каждая деталь внимательно создана и аттестует на высокое качество изготовления. Часы выполнены вручную, с использованием только самых лучших материалов и традиционных техник часового ремесла.',
      image: 'https://www.dhresource.com/600x600/f2/albu/g9/M00/F4/E1/rBVaWF2qon6AT4jSAAGh2-p253U559.jpg',
    },

    ], {});
  },

  async down(queryInterface, Sequelize) {
    /**
     * Add commands to revert seed here.
     *
     * Example:
     * await queryInterface.bulkDelete('People', null, {});
     */
  },
};
